#include <iostream> // Подключаем библиотеку для ввода/вывода.

int main() // Объявляем главную функцию.
{
	// Константа для числа π.
    // Используем const, чтобы значение не изменялось во время работы программы.
	// Используем double, так как π - это вещественное число.
	const double pi = 3.14;

	double R; // Создаём переменную для хранения значения радиуса круга.
	double S; // Создаём переменную для хранения результата значения площади круга.
	// Используем double, так как радиус и площадь могут быть дробными числами.
	
	std::cout << "Enter the R: "; // Запрашиваем значение радиуса.
	std::cin >> R; // Считываем введённое значение в переменную R.

	S = pi * R * R; // Пишем формулу площади круга заданного радиуса.

	std::cout << "Square: " << S << std::endl; // Выводим результат площади круга.

	return 0; // Успешное завершение программы.
}